RIOT-OS/RIOT/cpu/sam0_common/include/periph_cpu_common.h
#ifdef PM_SLEEPCFG_SLEEPMODE_OFF

/**
 * @brief   CPU provides own pm_off() function
 */
#  define PROVIDES_PM_OFF

/**
 * @brief   CPU provides own pm_off() function
 */
#  define PROVIDES_PM_LAYERED_OFF

#endif /* PM_SLEEPCFG_SLEEPMODE_OFF */

/**
 * @brief   Called before the power management enters a power mode
 *
 * @param[in] deep      1 for deep sleep, 0 otherwise
 */
void gpio_pm_cb_enter(int deep);

/**
 * @brief   Called after the power management left a power mode
 *
 * @param[in] deep      1 for deep sleep, 0 otherwise
 */
void gpio_pm_cb_leave(int deep);

/**
 * @brief   Called before the power management enters a power mode
 *
 * @param[in] deep      1 for deep sleep, 0 otherwise
 */
void cpu_pm_cb_enter(int deep);

/**
 * @brief   Called after the power management left a power mode
 *
 * @param[in] deep      1 for deep sleep, 0 otherwise
 */
void cpu_pm_cb_leave(int deep);

/**
 * @brief   Wrapper for cortexm_sleep calling power management callbacks
 *
 * @param[in] deep      1 for deep sleep, 0 otherwise
 */
static inline void sam0_cortexm_sleep(int deep)
{
#ifdef MODULE_PERIPH_GPIO
    gpio_pm_cb_enter(deep);
#endif

    cpu_pm_cb_enter(deep);

    cortexm_sleep(deep);

    cpu_pm_cb_leave(deep);

#ifdef MODULE_PERIPH_GPIO
    gpio_pm_cb_leave(deep);
#endif
}

/**
 * @brief   Disable alternate function (PMUX setting) for a PORT pin
 *
 * @param[in] pin   Pin to reset the multiplexing for
 */
void gpio_disable_mux(gpio_t pin);

/**
 * @brief   Available voltage regulators on the supply controller.
 */
typedef enum {
    SAM0_VREG_LDO,  /**< LDO, always available but not very power efficient */
    SAM0_VREG_BUCK  /**< Buck converter, efficient but may clash with internal
                         fast clock generators (see errata sheets) */
} sam0_supc_t;

/**
 * @brief       Switch the internal voltage regulator used for generating the
 *              internal MCU voltages.
 *              Available options are:
 *
 *               - LDO: not very efficient, but will always work
 *               - BUCK converter: Most efficient, but incompatible with the
 *                 use of DFLL or DPLL.
 *                 Please refer to the errata sheet, further restrictions may
 *                 apply depending on the MCU.
 *
 * @param[in]   src     Voltage regulator to use, see @ref sam0_supc_t for
 *                      options
 */
static inline void sam0_set_voltage_regulator(sam0_supc_t src)
{
#ifdef REG_SUPC_VREG
    if (src == SAM0_VREG_BUCK) {
        SUPC->VREG.reg |= (1 << SUPC_VREG_SEL_Pos);
    }
    else {
        SUPC->VREG.reg &= ~(1 << SUPC_VREG_SEL_Pos);
    }
    while (!(SUPC->STATUS.reg & SUPC_STATUS_VREGRDY)) {}
#else
    (void) src;
    assert(0);
#endif
}

/**
 * @brief   Returns the frequency of a GCLK provider.
 *
 * @param[in] id    The ID of the GCLK
 *
 * @return          The frequency of the GCLK with the given ID.
 */
uint32_t sam0_gclk_freq(uint8_t id);

/**
 * @brief   Enables an on-demand GCLK that has been configured in cpu.c
 *
 * @param[in] id    The ID of the GCLK
 */
void sam0_gclk_enable(uint8_t id);

/**
 * @brief   Return the numeric id of a SERCOM device derived from its address
 *
 * @param[in] sercom    SERCOM device
 *
 * @return              numeric id of the given SERCOM device
 */
static inline uint8_t sercom_id(const void *sercom)
{
#ifdef SERCOM0
    if (sercom == SERCOM0) {
        return 0;
    }
#endif
#ifdef SERCOM1
    if (sercom == SERCOM1) {
        return 1;
    }
#endif
#ifdef SERCOM2
    if (sercom == SERCOM2) {
        return 2;
    }
#endif
#ifdef SERCOM3
    if (sercom == SERCOM3) {
        return 3;
    }
#endif
#ifdef SERCOM4
    if (sercom == SERCOM4) {
        return 4;
    }
#endif
#ifdef SERCOM5
    if (sercom == SERCOM5) {
        return 5;
    }
#endif
#ifdef SERCOM6
    if (sercom == SERCOM6) {
        return 6;
    }
#endif
#ifdef SERCOM7
    if (sercom == SERCOM7) {
        return 7;
    }
#endif

    /* should not be reached, so fail with assert */
    assert(false);

    return SERCOM_INST_NUM;
}

/**
 * @brief   Enable peripheral clock for given SERCOM device
 *
 * @param[in] sercom    SERCOM device
 */
static inline void sercom_clk_en(void *sercom)
{
    const uint8_t id = sercom_id(sercom);
#if defined(CPU_COMMON_SAMD21)
    PM->APBCMASK.reg |= (PM_APBCMASK_SERCOM0 << id);
#elif defined (CPU_COMMON_SAMD5X)
    if (id < 2) {
        MCLK->APBAMASK.reg |= (1 << (id + 12));
    } else if (id < 4) {
        MCLK->APBBMASK.reg |= (1 << (id + 7));
    } else {
        MCLK->APBDMASK.reg |= (1 << (id - 4));
    }
#else
    if (id < 5) {
        MCLK->APBCMASK.reg |= (MCLK_APBCMASK_SERCOM0 << id);
    }
#  if defined(CPU_COMMON_SAML21)
    else {
        MCLK->APBDMASK.reg |= (MCLK_APBDMASK_SERCOM5);
    }
#  endif /* CPU_COMMON_SAML21 */
#endif
}

/**
 * @brief   Disable peripheral clock for given SERCOM device
 *
 * @param[in] sercom    SERCOM device
 */
static inline void sercom_clk_dis(void *sercom)
{
    const uint8_t id = sercom_id(sercom);
#if defined(CPU_COMMON_SAMD21)
    PM->APBCMASK.reg &= ~(PM_APBCMASK_SERCOM0 << id);
#elif defined (CPU_COMMON_SAMD5X)
    if (id < 2) {
        MCLK->APBAMASK.reg &= ~(1 << (id + 12));
    } else if (id < 4) {
        MCLK->APBBMASK.reg &= ~(1 << (id + 7));
    } else {
        MCLK->APBDMASK.reg &= ~(1 << (id - 4));
    }
#else
    if (id < 5) {
        MCLK->APBCMASK.reg &= ~(MCLK_APBCMASK_SERCOM0 << id);
    }
#  if defined (CPU_COMMON_SAML21)
    else {
        MCLK->APBDMASK.reg &= ~(MCLK_APBDMASK_SERCOM5);
    }
#  endif /* CPU_COMMON_SAML21 */
#endif
}

#ifdef CPU_COMMON_SAMD5X
static inline uint8_t _sercom_gclk_id_core(uint8_t sercom_id) {
    if (sercom_id < 2) {
        return sercom_id + 7;
    }
    else if (sercom_id < 4) {
        return sercom_id + 21;
    }
    else {
        return sercom_id + 30;
    }
}
#endif

/**
 * @brief   Configure generator clock for given SERCOM device
 *
 * @param[in] sercom    SERCOM device
 * @param[in] gclk      Generator clock
 */
static inline void sercom_set_gen(void *sercom, uint8_t gclk)
{
    const uint8_t id = sercom_id(sercom);
    sam0_gclk_enable(gclk);
#if defined(CPU_COMMON_SAMD21)
    GCLK->CLKCTRL.reg = (GCLK_CLKCTRL_CLKEN | GCLK_CLKCTRL_GEN(gclk) |
                         (SERCOM0_GCLK_ID_CORE + id));
    while (GCLK->STATUS.reg & GCLK_STATUS_SYNCBUSY) {}
#elif defined(CPU_COMMON_SAMD5X)
    GCLK->PCHCTRL[_sercom_gclk_id_core(id)].reg = (GCLK_PCHCTRL_CHEN | GCLK_PCHCTRL_GEN(gclk));
#else
    if (id < 5) {
        GCLK->PCHCTRL[SERCOM0_GCLK_ID_CORE + id].reg = (GCLK_PCHCTRL_CHEN | GCLK_PCHCTRL_GEN(gclk));
    }
#  if defined(CPU_COMMON_SAML21)
    else {
        GCLK->PCHCTRL[SERCOM5_GCLK_ID_CORE].reg = (GCLK_PCHCTRL_CHEN | GCLK_PCHCTRL_GEN(gclk));
    }
#  endif /* CPU_COMMON_SAML21 */
#endif
}

/**
 * @brief   Returns true if the CPU woke deep sleep (backup/standby)
 */
static inline bool cpu_woke_from_backup(void)
{
#ifdef RSTC_RCAUSE_BACKUP
    return RSTC->RCAUSE.reg & RSTC_RCAUSE_BACKUP;
#else
    return false;
#endif
}

/**
 * @brief ADC Channel Configuration
 */
typedef struct {
    uint32_t inputctrl;     /**< ADC channel pin multiplexer value  */
#ifdef ADC0
    Adc *dev;               /**< ADC device descriptor */
#endif
    uint32_t R_src;         /**< Resistance in Ω between the voltage
                                 to measure and the ADC pin */
} adc_conf_chan_t;

/**
 * @brief Compatibility define for muxpos struct member
 *        Unused on all platforms that have DIFFMODE in CTRLB
 */
#ifndef ADC_INPUTCTRL_DIFFMODE
#  define ADC_INPUTCTRL_DIFFMODE    (1 << 7)
#endif

/**
 * @brief Pin that can be used for external voltage reference A
 */
#define ADC_REFSEL_AREFA_PIN    GPIO_PIN(PA, 3)

/**
 * @brief Pin that can be used for external voltage reference B
 */
#define ADC_REFSEL_AREFB_PIN    GPIO_PIN(PA, 4)

#if defined(ADC_REFCTRL_REFSEL_AREFC) || DOXYGEN
/**
 * @brief Pin that can be used for external voltage reference C
 */
#  define ADC_REFSEL_AREFC_PIN  GPIO_PIN(PA, 6)
#endif

#ifndef DOXYGEN
#  define HAVE_ADC_RES_T
typedef enum {
    ADC_RES_6BIT  = 0xff,                       /**< not supported */
#  if defined(ADC_CTRLB_RESSEL)
    ADC_RES_8BIT  = ADC_CTRLB_RESSEL_8BIT_Val,  /**< ADC resolution: 8 bit */
    ADC_RES_10BIT = ADC_CTRLB_RESSEL_10BIT_Val, /**< ADC resolution: 10 bit */
    ADC_RES_12BIT = ADC_CTRLB_RESSEL_12BIT_Val, /**< ADC resolution: 12 bit */
#  elif defined(ADC_CTRLC_RESSEL)
    ADC_RES_8BIT  = ADC_CTRLC_RESSEL_8BIT_Val,  /**< ADC resolution: 8 bit */
    ADC_RES_10BIT = ADC_CTRLC_RESSEL_10BIT_Val, /**< ADC resolution: 10 bit */
    ADC_RES_12BIT = ADC_CTRLC_RESSEL_12BIT_Val, /**< ADC resolution: 12 bit */
#  endif
    ADC_RES_16BIT_2SAMPL    = ( 0x1 << 2) | 0x1, /**< sum of 2 12 bit samples    */
    ADC_RES_16BIT_4SAMPL    = ( 0x2 << 2) | 0x1, /**< sum of 4 12 bit samples    */
    ADC_RES_16BIT_8SAMPL    = ( 0x3 << 2) | 0x1, /**< sum of 8 12 bit samples    */
    ADC_RES_16BIT_16SAMPL   = ( 0x4 << 2) | 0x1, /**< sum of 16 12 bit samples   */
    ADC_RES_16BIT_32SAMPL   = ( 0x5 << 2) | 0x1, /**< sum of 32 12 bit samples   */
    ADC_RES_16BIT_64SAMPL   = ( 0x6 << 2) | 0x1, /**< sum of 64 12 bit samples   */
    ADC_RES_16BIT_128SAMPL  = ( 0x7 << 2) | 0x1, /**< sum of 128 12 bit samples  */
    ADC_RES_16BIT_256SAMPL  = ( 0x8 << 2) | 0x1, /**< sum of 256 12 bit samples  */
    ADC_RES_16BIT_512SAMPL  = ( 0x9 << 2) | 0x1, /**< sum of 512 12 bit samples  */
    ADC_RES_16BIT_1024SAMPL = ( 0xA << 2) | 0x1, /**< sum of 1024 12 bit samples */
    ADC_RES_14BIT = 0xfe,                        /**< not supported */
} adc_res_t;

#  define ADC_RES_16BIT ADC_RES_16BIT_16SAMPL   /**< default to 16x oversampling */
#endif /* DOXYGEN */

/**
 * @name Ethernet peripheral parameters
 * @{
 */
#ifndef ETH_RX_BUFFER_COUNT
#  define ETH_RX_BUFFER_COUNT (4)
#endif

#ifndef ETH_TX_BUFFER_COUNT
#  define ETH_TX_BUFFER_COUNT (2)
#endif

#ifndef ETH_RX_BUFFER_SIZE
#  define ETH_RX_BUFFER_SIZE (1536)
#endif

#ifndef ETH_TX_BUFFER_SIZE
#  define ETH_TX_BUFFER_SIZE (1536)
#endif
/** @} */

/**
 * @brief Ethernet parameters struct
 */
#if defined(GMAC_INST_NUM) || defined(DOXYGEN)
typedef struct {
    Gmac *dev;                /**< ptr to the device registers */
    gpio_t refclk;            /**< REFCLK gpio */
    gpio_t txen;              /**< TXEN gpio */
    gpio_t txd0;              /**< TXD0 gpio */
    gpio_t txd1;              /**< TXD1 gpio */
    gpio_t crsdv;             /**< CRSDV gpio */
    gpio_t rxd0;              /**< RXD0 gpio */
    gpio_t rxd1;              /**< RXD1 gpio */
    gpio_t rxer;              /**< RXER gpio */
    gpio_t mdc;               /**< MII interface, clock gpio */
    gpio_t mdio;              /**< MII interface, data gpio */
    gpio_t rst_pin;           /**< PHY reset gpio */
    gpio_t int_pin;           /**< PHY interrupt gpio */
} sam0_common_gmac_config_t;
#endif

/**
 * @brief USBDEV buffers must be word aligned because of DMA restrictions
 */
#define USBDEV_CPU_DMA_ALIGNMENT       (4)

/**
 * @brief USBDEV buffer instantiation requirement
 */
#define USBDEV_CPU_DMA_REQUIREMENTS    __attribute__((aligned(USBDEV_CPU_DMA_ALIGNMENT)))

/**
 * @brief USB peripheral parameters
 */
#if defined(USB_INST_NUM) || defined(DOXYGEN)
typedef struct {
    gpio_t dm;              /**< D- line gpio                           */
    gpio_t dp;              /**< D+ line gpio                           */
    gpio_mux_t d_mux;       /**< alternate function (mux) for data pins */
    UsbDevice *device;      /**< ptr to the device registers            */
    uint8_t gclk_src;       /**< GCLK source which supplys 48 MHz       */
} sam0_common_usb_config_t;
