RIOT-OS/RIOT/cpu/sam0_common/include/periph_cpu_common.h
#endif /* USB_INST_NUM */

/**
 * @brief SDIO/SDMMC buffer alignment for SDHC because of DMA/FIFO buffer restrictions
 */
#define SDMMC_CPU_DMA_ALIGNMENT     4

/**
 * @brief SDIO/SDMMC buffer instantiation requirement for SDHC
 */
#define SDMMC_CPU_DMA_REQUIREMENTS  __attribute__((aligned(SDMMC_CPU_DMA_ALIGNMENT)))

/**
 * @brief SDHC peripheral configuration
 */
typedef struct {
    void *sdhc; /**< SDHC peripheral */
    gpio_t cd;  /**< Card Detect pin (must be GPIO_UNDEF if not connected) */
    gpio_t wp;  /**< Write Protect pin (must be GPIO_UNDEF if not connected) */
} sdhc_conf_t;

/**
 * @name    WDT upper and lower bound times in ms
 * @{
 */
/* Limits are in clock cycles according to data sheet.
   As the WDT is clocked by a 1024 Hz clock, 1 cycle ≈ 1 ms */
#define NWDT_TIME_LOWER_LIMIT          (8U)
#define NWDT_TIME_UPPER_LIMIT          (16384U)
/** @} */

/**
 * @brief Watchdog can be stopped.
 */
#define WDT_HAS_STOP                   (1)
/**
 * @brief Watchdog has to be initialized.
 */
#define WDT_HAS_INIT                   (1)

/**
 * @brief   Frequency meter configuration
 */
typedef struct {
    gpio_t pin;             /**< GPIO at which the frequency is to be measured */
    uint8_t gclk_src;       /**< GCLK source select for reference */
} freqm_config_t;

#if defined(REV_DMAC) || DOXYGEN
/**
 * @name sam0 DMA peripheral
 * @{
 *
 * The sam0 DMA peripheral has a number of channels. Each channel is a separate
 * data stream, triggered by a configurable trigger when enabled, or triggered
 * by software (not yet supported). In theory each DMA channel is equal and can
 * have a configurable priority and can be triggered by the full set of triggers
 * available.
 *
 * DMA descriptors, specifying a single transfer with size, source and
 * destination, are kept in RAM and are read when the channel is enabled and
 * triggered. On the SAML21 platform, these descriptors must reside in the LP
 * SRAM.
 *
 * The DMA addresses supplied must point to the **end** of the array to be
 * transferred. When address increment is enabled this means that the supplied
 * src or dst argument must point to array + length. When increment is disabled,
 * the source or destination address can be used directly. The calculation of
 * the end of the array must be done by the calling function, because the
 * beatsize and the increment can usually be hardcoded there and doesn't have to
 * be retrieved from the DMA register configuration.
 * See also section 20.6.2.7 of the SAM D21/DA1 Family Data Sheet.
 *
 * Example:
 * ```
 * void transfer_data(void *src, void *dst, size_t len)
 * {
 *      dma_t channel = dma_acquire_channel()
 *      if (channel == 0xff) {
 *          return -E_BUSY;
 *      }
 *
 *      dma_setup(channel, DMA_TRIGGER_MY_PERIH, 0, true);
 *      dma_prepare(channel, DMAC_BTCTRL_BEATSIZE_BYTE_Val,
 *                  (uint8_t*)src + len, (uint8_t*)dst + len, len);
 *
 *      dma_start(channel);
 *      dma_wait(channel);
 *
 *      dma_release_channel(channel);
 * }
 * ```
 */

/**
 * @brief Indicates that the peripheral doesn't utilize the DMA controller.
 *        Matches with the register configuration for software based triggers.
 */
#  define DMA_TRIGGER_DISABLED         0

/**
 * @brief Move the DMA descriptors to the LP SRAM. Required on the SAML21
 */
#  if defined(CPU_COMMON_SAML21) || defined(DOXYGEN)
#    define DMA_DESCRIPTOR_IN_LPSRAM
#  endif

/**
 * @brief Extra attributes required for instantiating DMA descriptors.
 */
#  ifdef DMA_DESCRIPTOR_IN_LPSRAM
#    define DMA_DESCRIPTOR_ATTRS    __attribute__((section(".backup.bss")))
#  else
#    define DMA_DESCRIPTOR_ATTRS
#  endif

/**
 * @brief DMA channel type
 */
typedef unsigned dma_t;

/**
 * @brief Available DMA address increment modes
 */
typedef enum {
    DMA_INCR_NONE   = 0,    /**< Don't increment any addresses after a beat */
    DMA_INCR_SRC    = 1,    /**< Increment the source address after a beat */
    DMA_INCR_DEST   = 2,    /**< Increment destination address after a beat */
    DMA_INCR_BOTH   = 3,    /**< Increment both addresses after a beat */
} dma_incr_t;

/**
 * @brief   Initialize DMA
 */
void dma_init(void);

/**
 * @brief Acquire a DMA channel.
 *
 * A free DMA channel is marked as allocated and a reference is returned.
 * DMA channels can be acquired for long periods of time, e.g. from the start to
 * end of a number of transfers or directly at boot and never released.
 *
 * @returns     A reference to the DMA channel
 * @returns     UINT8_MAX when no DMA channel is available
 */
dma_t dma_acquire_channel(void);

/**
 * @brief   Release a previously acquired DMA channel
 *
 * @param   dma     DMA channel to release
 */
void dma_release_channel(dma_t dma);

/**
 * @brief   Initialize a previously allocated DMA channel with one-time settings
 *
 * @param   dma     DMA channel reference
 * @param   trigger Trigger to use for this DMA channel
 * @param   prio    Channel priority
 * @param   irq     Whether to enable the interrupt handler for this channel
 */
void dma_setup(dma_t dma, unsigned trigger, uint8_t prio, bool irq);

/**
 * @brief   Prepare the DMA channel for an individual transfer.
 *
 * @note    When increment is enabled for source or destination, the @p src
 *          and/or @p dst must point to the **end** of the array.
 *
 * @param   dma     DMA channel reference
 * @param   width   Transfer beat size to use
 * @param   src     Source address for the transfer
 * @param   dst     Destination address for the transfer
 * @param   num     Number of beats to transfer
 * @param   incr    Which of the addresses to increment after a beat
 */
void dma_prepare(dma_t dma, uint8_t width, const void *src, void *dst,
                 size_t num, dma_incr_t incr);

/**
 * @brief   Prepare a transfer without modifying the destination address
 *          settings.
 *
 * Can be used when repeatedly using a dma channel to transfer to the same
 * peripheral address, leaving the destination address and related settings
 * untouched
 *
 * @note    This only touches the source address, number of transfers and source
 *          increment settings. Be sure to initialize the full descriptor
 *          beforehand with @ref dma_prepare
 *
 * @note    When increment is enabled for source, the @p src must point to the
 *          **end** of the array.
 *
 * @param   dma     DMA channel reference
 * @param   src     Source address for the transfer
 * @param   num     Number of beats to transfer
 * @param   incr    Whether to increment the source address after a beat
 */
void dma_prepare_src(dma_t dma, const void *src, size_t num, bool incr);

/**
 * @brief   Prepare a transfer without modifying the source address
 *          settings.
 *
 * Can be used when repeatedly using a dma channel to transfer from the same
 * peripheral address, leaving the source address and related settings
 * untouched
 *
 * @note    This only touches the destination address, the number of transfers
 *          and destination increment settings. Be sure to initialize the full
 *          descriptor beforehand with @ref dma_prepare
 *
 * @note    When increment is enabled for destination, @p dst must point to the
 *          **end** of the array.
 *
 * @param   dma     DMA channel reference
 * @param   dst     Destination address for the transfer
 * @param   num     Number of beats to transfer
 * @param   incr    Whether to increment the destination address after a beat
 */
void dma_prepare_dst(dma_t dma, void *dst, size_t num, bool incr);

/**
 * @brief   Append a second transfer descriptor after the default channel
 *          descriptor.
 *
 * @note    Only a single extra transfer descriptor is supported for now.
 *
 * @note    @p next must remain valid throughout the full transfer duration
 *
 * @note    When increment is enabled for source or destination, @p src
 *          and/or @p dst must point to the **end** of the array.
 *
 * @param   dma         DMA channel reference to add the descriptor to
 * @param   descriptor  Extra transfer descriptor to append
 * @param   width       Transfer beat size to use
 * @param   src         Source address for the transfer
 * @param   dst         Destination address for the transfer
 * @param   num         Number of beats to transfer
 * @param   incr        Which of the addresses to increment after a beat
 */
void dma_append(dma_t dma, DmacDescriptor *descriptor, uint8_t width,
                const void *src, void *dst, size_t num, dma_incr_t incr);

/**
 * @brief   Append a second transfer descriptor after the default channel
 *          descriptor, copying destination and block size from the initial
 *          descriptor.
 *
 * @note    Only a single extra transfer descriptor is supported for now.
 *
 * @note    @p next must remain valid throughout the full transfer duration
 *
 * @note    When increment is enabled for source, @p src must point to the
 *          **end** of the array.
 *
 * @param   dma     DMA channel reference to add the descriptor to
 * @param   next    Extra transfer descriptor to append
 * @param   src     Source address for the transfer
 * @param   num     Number of beats to transfer
 * @param   incr    Whether to increment the source address after a beat
 */
void dma_append_src(dma_t dma, DmacDescriptor *next, const void *src,
                    size_t num, bool incr);

/**
 * @brief   Append a second transfer descriptor after the default channel
 *          descriptor, copying source and block size from the initial
 *          descriptor.
 *
 * @note    Only a single extra transfer descriptor is supported for now.
 *
 * @note    @p next must remain valid throughout the full transfer duration
 *
 * @note    When increment is enabled for destination, @p dst must point to the
 *          **end** of the array.
 *
 * @param   dma     DMA channel reference to add the descriptor to
 * @param   next    Extra transfer descriptor to append
 * @param   dst     Destination address for the transfer
 * @param   num     Number of beats to transfer
 * @param   incr    Whether to increment the source address after a beat
 */
void dma_append_dst(dma_t dma, DmacDescriptor *next, void *dst, size_t num,
                    bool incr);

/**
 * @brief   Start a DMA transfer.
 *
 * @param   dma     DMA channel reference
 */
void dma_start(dma_t dma);

/**
 * @brief   Wait for a DMA channel to finish the transfer.
 *
 * This function uses a blocking mutex to wait for the transfer to finish
 *
 * @note Use only with DMA channels of which the interrupt is enabled
 *
 * @param   dma     DMA channel reference
 */
void dma_wait(dma_t dma);

/**
 * @brief   Cancel an active DMA transfer
 *
 * It is not harmful to call this on an inactive channel, but it will waste some
 * processing time
 *
 * @param   dma     DMA channel reference
 */
void dma_cancel(dma_t dma);
/** @} */
#endif /* REV_DMAC || DOXYGEN */

/**
 * @name sam0 RTC Tamper Detection
 * @{
 */

/**
 * @brief   Power on the RTC (if the RTC/RTT is not otherwise used)
 */
void rtc_tamper_init(void);

/**
 * @brief   Enable Tamper Detection IRQs
 *
 * @param   pin     The GPIO pin to be used for tamper detection
 * @param   flank   The Flank to trigger the even
 *
 * @return  0 on success, -1 if pin is not an RTC pin
 */
int rtc_tamper_register(gpio_t pin, gpio_flank_t flank);

/**
 * @brief   (Re-)Enable Tamper Detection pin
 *
 * @param   pin     The GPIO pin to be used for tamper detection
 *
 * @return  0 on success, -1 if pin is not an RTC pin
 */
int rtc_tamper_pin_enable(gpio_t pin);

/**
 * @brief   Disable Tamper Detection pin
 *
 * @param   pin     The GPIO pin to no longer be used for tamper detection
 */
void rtc_tamper_pin_disable(gpio_t pin);

/**
 * @brief   Enable Tamper Detection IRQs
 */
void rtc_tamper_enable(void);

/**
 * @brief   Get and clear the RTC tamper event that has woken the CPU
 *          from Deep Sleep.
 *
 * @return  The set bits in the return value correspond to the tamper
 *          pin index inside the @ref rtc_tamper_pins array.
 */
uint8_t rtc_get_tamper_event(void);

/**
 * @brief   Get the tamper event mask for a certain pin.
 *          Can be used together with @ref rtc_get_tamper_event to
 *          check which RTC  pin caused the tamper event.
 *
 * @param pin   Pin to query
 *
 * @return  Bit mask with the bit corresponding to @p pin set
 *          0 if @p pin is no RTC tamper pin
 */
uint8_t rtc_tamper_pin_mask(gpio_t pin);
/** @} */

/**
 * @name sam0 User Configuration
 *
 *      The MCUs of this family contain a region of memory that is used to store
 *      CPU configuration & calibration data.
 *      It can be used to set persistent settings and has some additional space
 *      to store user configuration data.
 * @{
 */

/**
 * @brief MCU configuration applied on start. The contents of this struct differ
 *        between families.
 */
typedef struct sam0_aux_cfg_mapping nvm_user_page_t;

/**
 * @brief   Size of the free to use auxiliary area in the user page
 */
#ifdef FLASH_USER_PAGE_SIZE
#  define FLASH_USER_PAGE_AUX_SIZE (FLASH_USER_PAGE_SIZE - sizeof(nvm_user_page_t))
#else
#  define FLASH_USER_PAGE_AUX_SIZE (AUX_PAGE_SIZE * AUX_NB_OF_PAGES - sizeof(nvm_user_page_t))
#endif

/**
 * @brief   Reset the configuration area, apply a new configuration.
 *
 *
 * @param   cfg     New MCU configuration, may be NULL.
 *                  If cfg is NULL, this will clear the configuration area
 *                  and apply the current configuration again.
 */
void sam0_flashpage_aux_reset(const nvm_user_page_t *cfg);

/**
 * @brief   Write data to the user configuration area.
 *          This will write data to the remaining space after @see nvm_user_page_t
 *          The size of this area depends on the MCU family used.
 *
 *          Will only write bits 1 -> 0. To reset bits to 1, call @see sam0_flashpage_aux_reset
 *          This will reset the whole user area configuration.
 *
 *          Arbitrary data lengths and offsets are supported.
 *
 * @param   offset  Byte offset after @see nvm_user_page_t
 *                  must be less than `FLASH_USER_PAGE_AUX_SIZE`
 * @param   data    The data to write
 * @param   len     Size of the data
 */
void sam0_flashpage_aux_write(uint32_t offset, const void *data, size_t len);

/**
 * @brief   Get pointer to data in the user configuration area.
 *
 * @param   offset  Byte offset after @see nvm_user_page_t
 *                  must be less than `FLASH_USER_PAGE_AUX_SIZE`
 * @return  Pointer to the data in the User Page
 */
#define sam0_flashpage_aux_get(offset)  \
    (const void*)((uint8_t*)NVMCTRL_USER + sizeof(nvm_user_page_t) + (offset))

/**
 * @brief   Get pointer to data in the CPU configuration struct
 *
 * @return  Pointer to the @ref nvm_user_page_t structure
 */
#define sam0_flashpage_aux_cfg() \
    ((const nvm_user_page_t*)NVMCTRL_USER)

/** @} */

#ifdef __cplusplus
}
#endif

/** @} */
